"""2) for ციკლის საშვალებით დაბეჭდეთ რიცხვები 0-იდან 20-მდე, შეამოწმეთ თითოეული რიცხვი ლუწია თუ კენტი, თუ ლუწია დაბეჭდეთ "even" თუ კენტია დაბეჭდეთ odd და გვერდზე მიუწერეთ ეს რიცხვი თითოეულ შემთხვევაში"""

for number in range(20):
    if number % 2 == 0:
        print(number, "Even")
    else:
        print(number, "Odd")
        
        
        
        
        
        
        
number=0
while number < 20:
    number += 1
    if number % 2 == 0:
        print(number, "Even")
    else:
        print(number, "Odd")
        
        
# elif აერთიანებს if და else-ს, ამიტომ else-ის გამოყენება არ არის საჭირო,აქ რომ ეწეროს if ,if,if,if,if და სქორი იქნება 90 მაგალითად, მაშინ 90-ზე მეტია 80-ზე და 60-ზე და 40-ზე და 20-ზე და შესაბამისად ყველაფერი გამოვა

"""1) მოხმარებელს შემოატანინეთ რიცხვი, შემდეგ კი დაუბეჭდეთ ეს რიცხვი დადებითია, უარყოფითი თუ ნეიტურალი ანუ ნული. შემდეგ კომენტარებით ახსენით რა გასნხვავებაა if-სა და elif-ს შორის რატომ არ შეიძლება ზოგერ elif-ს ნაცვლად if-ის გამოყენება"""
input_number = int(input("Enter a number: "))
if input_number > 0:
    print("Positive")
elif input_number < 0:
    print("Negative")
else:
    print("neitral")
# elif აერთიანებს if და else-ს, ამიტომ else-ის გამოყენება არ არის ყოველთვის საჭირო საჭირო,აქ (ქულებზე) რომ ეწეროს if ,if,if,if,if და სქორი იქნება 90 მაგალითად, მაშინ 90-ზე მეტია 80-ზე და 60-ზე და 40-ზე და 20-ზე და შესაბამისად ყველაფერი გამოვა a b c d f,da viyenebt roca ramdenime piroba gvaqvs