# 2) დაწერეთ პროგრამა, რომელიც ითხოვს ორ რიცხვს მომხმარებლისგან. შემოაყვანინეთ მომხმარებელს დაწყების და დასრულების რიცხვი. თუ მეორე რიცხვი ნაკლებია პირველზე, გამოუტანეთ შეტყობინება: არასწორი შუალედი. სხვა შემთხვევაში დაბეჭდეთ ყველა რიცხვი მოცემულ შუალედში ჩათვლით და იპოვეთ ამ რიცხვების ჯამი. გამოიყენეთ for ციკლი, if-else პირობა, input ფუნქცია, და int ტიპში გადაყვანა
k=int(input("შეიყვანეთ პირველი რიცხვი: "))
g=int(input("შეიყვანეთ მეორე რიცხვი: "))
sum=0
if g<k:
    print("არასწორი შუალედი")
else:
    sum=0
    for i in range(k,g+1):
        print(i)
        sum+=i
    print("ჯამი არის: ",sum)
