# 2) შექმენით პროგრამა, რომელიც:

# •    კლავიატურიდან მიიღებს ტექსტს (მინიმუმ 4 სიტყვა)
# •    შეინახავს ამ ტექსტს words.txt ფაილში
# •    წაიკითხავს ფაილს და შეასრულებს შემდეგ ოპერაციებს:
# დათვლის თანხმოვანი ასოების რაოდენობას
# იპოვის ყველაზე მოკლე სიტყვას
# გადაიყვანს ყველა დიდ ასოს პატარა ასოში და პირიქით (swap case)
# •    დამუშავებული ტექსტი შეინახოს processed.txt ფაილში
# •    კონსოლში გამოიტანოს: სიტყვების რაოდენობა, თანხმოვნები და ყველაზე მოკლე სიტყვა

input_text = input("შეიყვანეთ ტექსტი (მინიმუმ 4 სიტყვა): ")
words = input_text.split()
if len(words) < 4:
    print("გთხოვთ შეიყვანოთ მინიმუმ 4 სიტყვა.")
    exit()