# """შექმენით პროგრამა while ციკლით რომელიც მომხარებელს შეეკითხება pin კოდს (4 ციფრიანი კოდი) იქამდე სანამ არ შემოიყვანს სწორად, საბოლოოდ დაუბეჭდეთ რომ გაიარა ავტორიზაცია და გამოუტანეთ თუ რამდენი ცდა დასჭირდა"""

# pin_code = "6464"
# entered_pin = ""

# count = 0

# while entered_pin != pin_code:
#     entered_pin = input("Enter pin code: ")
#     count += 1

# print(f"You're authorizied. You took {count} attempts")


# როცა ფრჩხილებში არის ფ მაშინ {}ეს ფრჩხილი-(ში)ჩასმული ყველაფერი = სტრინგი 





# caunter არის ციკლი რაოდენობების შემნახავი
# რანგე იგივე


# 1) შექმენით while ციკლი რომელიც გამოიტანს კენტ რიცხვებს 100-იდან 300-მდე
n=99
while n <= 300:
    n += 2
    print(n)