// 7) შექმენით Product კომპონენტი, რომელიც მიიღებს props-ით productName და price მნიშვნელობებს. კომპონენტში გამოიტანეთ ორივე <p> ელემენტში. კომენტარებით ახსენით რატომ ვიყენებთ props-ს კომპონენტებს შორის მონაცემების გადასაცემად
function Product(props) {
    // props არის ობიექტი, რომელიც შეიცავს ყველა თვისებას (properties), რომლებიც გადაეცემა კომპონენტს
    return (
        <div>
            <p>Product Name: {props.productName}</p> {/* აქ ჩვენ გამოვიყენებთ props-ის productName თვისებას, რათა გამოვიტანოთ პროდუქტის სახელი <p> ელემენტში */}
            <p>Price: {props.price}</p> {/* აქ ჩვენ გამოვიყენებთ props-ის price თვისებას, რათა გამოვიტანოთ ფასი <p> ელემენტში */}
        </div>
    );
}