// 2) შექმენით Greeting კომპონენტი, რომელიც გამოიტანს <h1> ელემენტში props-ით მიღებულ ტექსტს. App.jsx-ში გამოიყენეთ Greeting კომპონენტი და გადაეცით მას ტექსტი "Hello React". კომენტარებით ახსენით რას აკეთებს props

function Greeting(props) {
    // props არის ობიექტი, რომელიც შეიცავს ყველა თვისებას (properties), რომლებიც გადაეცემა კომპონენტს
    return <h1>{props.text}</h1>; // აქ ჩვენ გამოვიყენებთ props-ის text თვისებას, რათა გამოვიტანოთ ტექსტი <h1> ელემენტში
}
Greeting({ text: "Hello React" }); // აქ ჩვენ ვქმნით Greeting კომპონენტს და გადაეცემა მას text თვისება "Hello React"-ის მნიშვნელობით