// 2) შექმენით ფუნქცია რომელიც მიიღებს 2 პარამეტრს, პირველ პარამტერში უნდა იყოს პირველი არგუმენტი, ხოლო მეორეში განუსაზღვრელი რაოდენობით ყველა სხვა არგუმენტი. შემდეგ შექმენით რიცხვების სია რომელსაც ...spread operator-ით ჩასვამთ საერთო რიხვების სიაში სადაც ეს სია უნდა იყოს შუაში

let person={
    balance:11,
    firstname:'nika'
}
let {balance,firstname}=person
console.log(balance)
console.log(firstname)

// spread ოპერატორი
let ma=[5,33,775,1]
let mamam=[6,29, ... ma ,487269]
//... (rest პარამეტრი) ნიშნავს რომ პარამეტრი იქნება array,ეს გვჭირდება მაშინ როდესაც არ ვიცით რამდენ პარამეტსრ მივიღებთ
function any(... rest) {
    console.log(rest)
}
any([11,33,55])