// 1) შექმენით account ობიექტი რომელშიც კუთვნილების სახელები იქნება გამოსახულებები, კუთვნიელბის სახელები იყოს რაიმე ცვლადები და ზოგ შემთხვევაში string-ების კონკატინაცია, შექმენით deposit რომელიც ობიექტის this.balance კუთვნილებას გაზრდით amount პარამეტრით, ეს მეთოდი 2-ჯერ გამოიძახეთ, შემდეგ შექემნით person ობიექტი რაიმე სხვა კუთვნილებებითა და balance-ით, შემდეგ ამ ორი 2 ობიექტის Object.assign() მეთოდით გაერთიანებით შექმენით personAccount ობიექტი სამივე ობიექტი გამოიტანეთ კონსოლში. შემდეგ dataArr მასივი 3 ელემენტი და მოახდინეთ მისი დესქტრურირება სამივე ელემენტი შეინახეთ 3 სხვასხვა ცვლადშ და გამოიტანეთ კონსოლში, კომენტარებით ახსენით ყველაფერი
// this გამოიყენება იმისთვი,რომ მივწვდეთ ობიექტის თვისებას მეთოდს
let inputname='username'

let pp={
    [inputname]:'luka',
    sn:'kk',
    balance:100,
    dep(){   {
        this.balance += 50
    }}
}
let pp2={
    sn:'bb',
    balance:200,
    kaka:'maymay'
}
// [inputname]:'luka',  ეს არის computed property name თუ [-ს არ გამოვიყენებდით, მაშინ თვისების სახელი პირდაპირ inputname იქნებოდა]
// assign -ახალი ობიექტის შეერთება რომ მივიღოთ ახალი ობიექტი ,თო ორივეში არის ერთი და იგივე ცვლადი მაშინ დარჩება ის რომელიც ეწერა ბოლოობად
let assignedobj=Object.assign(pp,pp2)

// ელემენტის დესქტრუქტურირება
let dd=['4df4ff','3frgth35','f4wg']
let [color1,color2,color3]=dd
console.log(color1);
console.log(color2);
console.log(color3);