// // for in js for()
// for (let i = 0; i < 10; i++) {
//     console.log(i);
// }
// // ეს for ციკლი 0 დან 9 მდე დაბეჭდავს ყველა რიცხვს
// // for of js for()
// let arr = ['a', 'b', 'c', 'd', 'e'];

// for (of) ციკლი გამოიყენება მასივების შემთხვევაში და მასივის ყველა ელემენტს ცალ-ცალკე გამოიტანს
for (let value of arr) {
    console.log(value);
}
// for (in) ციკლი გამოიყენება ობიექტების შემთხვევაში და ობიექტის ყველა გასაღებს ცალ-ცალკე გამოიტანს
let obj = { a: 1, b: 2, c: 3 };
for (let key in obj) {
    console.log(key); // დაბეჭდავს a,b,c
    console.log(obj[key]); // დაბეჭდავს 1,2,3
}

// 2) შექმენით for ციკლი javascript-ში რომელიც გამოიტანს რიცხვებს 1-იდან 30-მდე, შემდეგ ახალი for ციკლი რომელიც გამოიტანს კენტ რიცხვებს 5-იდან 40-მდე, ასევე for ციკლი რომელიც გამოიტანს რიცხვებს 20-იდან 0-მდე, კომენტარებით დაწერეთ რა არის for of და for in ციკლები
for (let i = 1; i <= 30; i++) {
    console.log(i);
}
for (let i = 5; i <= 40; i++) {
    if (i % 2 !== 0) {
        console.log(i);  
    }
}
for (let i = 20; i >= 0; i--) {
    console.log(i);
}
// for (of) ციკლი გამოიყენება მასივების შემთხვევაში და მასივის ყველა ელემენტს ცალ-ცალკე გამოიტანს
// for (in) ციკლი გამოიყენება ობიექტების შემთხვევაში და ობიექტის ყველა გასაღებს ცალ-ცალკე გამოიტანს