// 5) შექმენით მაგალითი, სადაც setTimeout გამოიძახებს ფუნქციას 1 წამში და კონსოლში გამოიტანს ტექსტს "1 second passed". კომენტარებით ახსენით განსხვავება setTimeout და setInterval ფუნქციებს შორის
setTimeout(function() {
    console.log("1 second passed"); // 1 წამში კონსოლში გამოიტანეთ ტექსტი
}, 1000); // setTimeout ფუნქცია იღებს ორ არგუმენტს: პირველია ფუნქცია, რომელიც შესრულდება ერთხელ, მეორე კი დრო მილიწამებში, რამდენი ხნის შემდეგ შესრულდება ფუნქცია (აქ 1000 მილიწამი = 1 წამი)
// setTimeout ფუნქცია გამოიყენება იმისთვის, რომ ფუნქცია ერთხელ შესრულდეს გარკვეული დროის შემდეგ, ხოლო setInterval ფუნქცია ფუნქციას განმეორებით ასრულებს გარკვეული ინტერვალით.
