import { useState } from 'react'
import reactLogo from './assets/react.svg'
import viteLogo from '/vite.svg'
import './App.css'
// 12) კომენტარებით ახსენით რას ნიშანვს აპლიკაციის კომპონენტებად დაყოფა და რა უპირატესობები აქვს
// კომპონენტებად დაყოფა ნიშნავს კოდის რაღაც ნაწილის სხვადაასხვა ფაილში დანაწილებას და რპომონენტების სახით ორგანიზებას.
// უპირატესობები:
// 1. კოდის გამეორების შემცირება - ერთნაირი ფუნქციონალისთვის ერთი კომპონენტის გამოყენება
// 2. კოდის წაკითხვის და მენეჯმენტის გამარტივება - პატარა კომპონენტები ადვილად იკითხება და მართვადია
// 3. ხელახლა გამოყენებადობა - ერთი კომპონენტის გამოყენება სხვადასხვა ადგილას აპლიკაციაში
// 4. გუნდური მუშაობის გამარტივება - სხვადასხვა დეველოპერები მუშაობენ სხვადასხვა კომპონენტებზე პარალელურად
function App() {
  
  
  return (
    <>
      
    </>
    
  )
}

export default App
