# 2) შექმენით რიცხვების სია, შემდეგ ყოველი რიცხვი რომელიც კენტია გაამრავლეთ ორზე და დაამატეთ new_list-ში, ჯერ გააკეთეთ ეს დავალება ჩვეულებრივად, შემდეგ კი list comperhensiosns გამოყენებით. ასევე გააკეთეთ კიდევ 2 მაგალითი თქვენით, პირველ მაგალითში აიღეთ მხოლოდ გამოსახულების დამატება list comperhensions-ში, მეორე მაგალითში კი აიღეთ მხოლოდ პირობა
# list comperhensions
nums=[1,2,3,4,5,6,7,]
new_list=[]
for i in nums:
    if i % 2 == 1:
        new_list.append(i*2)   
# ამის შემოკლებულ ვერსია
new_list = [i*2 for i in nums if i % 2 == 1]
# თუ       ^ აქ დავწერთ რამე მოქმედება მაშინ ის ახალ სიაში ჩაიწერება იმ პირობით რასაც თქვენ მიუთითებთ
# დანარჩენი იგივეა
# კიდე 2
al=['f','e']
zz=[i for i in al]