// 7) კომენტარებში ჩამოწერეთ:
// - ერთი უპირატესობა controlled კომპონენტების
// - ერთი უპირატესობა uncontrolled კომპონენტების
// და როდის ჯობს თითოეულის გამოყენება

// Controlled კომპონენტების უპირატესობაა ის, რომ მათი მნიშვნელობები კონტროლდება React-ის state-ით, რაც საშუალებას გვაძლევს მარტივად ვმართოთ და ვვალიდიროთ ფორმის მონაცემები.

// Uncontrolled კომპონენტების უპირატესობაა ის, რომ ისინი ნაკლებად კომპლექსურია და არ საჭიროებენ state-ის მართვას, რაც ზოგჯერ შეიძლება იყოს უფრო ეფექტური პატარა ფორმებისთვის ან როდესაც არ არის საჭირო მუდმივი კონტროლი.