// ჯავასკრიპტში = ნიშვის ოპერატორია, რომელიც მნიშვნელობას ანიჭებს ცვლადს.
// == ნიშვის ოპერატორია, რომელიც შედარების დროს შეადარებს მხოლოდ მნიშვნელობებს და არა ტიპებს.
// === ნიშვის ოპერატორია, რომელიც შედარების დროს შეადარებს როგორც მნიშვნელობებს, ასევე ტიპებს.
// confirm() - ფუნქცია, რომელიც გამოიტანს დიალოგურ ფანჯარას, სადაც მომხმარებელს ექნება არჩევანი "OK" ან "Cancel". თუ მომხმარებელი დააჭერს "OK", ფუნქცია დააბრუნებს true, ხოლო თუ "Cancel", დააბრუნებს false.
// confirm("Do you want to continue?"); // დიალოგური ფანჯარა მომხმარებლისთვის

// 2) შექმენით ფორმა, რომელშიც სახელის, ემაილისა და პაროლის input-თან ერთად გექნებათ პრიბოების დამადასტურებელი checbox, როდესაც მოხდება ღილაკზე დაჭერა confirm ფუნქციით მომხმარებელს კითხეთ "Are you sure?" შემდეგ ამ ფუნქციიდან დაბრუნებული console-ში გამოიტანეთ
function confirmAction() {
    const result = confirm("Are you sure?");
    console.log("User confirmed:", result);

    if (result) {
        console.log('მომხმარებელმა დააჭირა OK');
    } else {
        console.log('მომხმარებელმა დააჭირა Cancel');
    }
}
// console.dir გამოიყენება იმისთვის, რომ კონსოლში დეტალურად გამოიტანოს ობიექტის სტრუქტურა და თვისებები. ეს განსაკუთრებით სასარგებლოა, როდესაც გსურთ დაათვალიეროთ DOM ელემენტი ან სხვა კომპლექსური ობიექტი.
// checked არის checkbox ან radio button ელემენტის თვისება, რომელიც მიუთითებს, არის თუ არა ის მონიშნული (true) თუ არა (false).