//json 

// 1) შექმენით accounts.json ფაილი რომელშიც აიღებთ js-ის სინტაქსით მასივს და დაამტებთ 2 account-ის ობიექტს რომლებსაც ექნებათ სახელი და balance, შემდეგ ეს ობიექტები გადაიტანეთ js-ში და გადააქციეთ სტრინგად, კონსოლში გამოიტანეთ JSON.parse() მეთოდის გამოყენებით, შემდეგ აიღეთ მეორე ვარინატი მასივის სახით მოცემული ეს json მონაცემები და JSON.stirngify()-ის გამოყენებით გადააქციეთ სტრინგად, დაწერეთ რა არის JSON რა დანიშნულებ და რა თვისებები აქვს
let accounts = [
    {
        "name": "Luka",
        "balance": 1500
    },
    {
        "name": "Nika",
        "balance": 2500
    }
];
let jsonString = JSON.stringify(accounts);
console.log(jsonString);
let parsedAccounts = JSON.parse(jsonString);
console.log(parsedAccounts);
// JSON (JavaScript Object Notation) არის მსუბუქი მონაცემთა გაცვლის ფორმატი, რომელიც ადვილად წაიკითხება და დაწერება ადამიანების მიერ და ადვილად გაანალიზდება და შექმნება მანქანების მიერ. JSON-ის ძირითადი დანიშნულებაა მონაცემთა სტრუქტურირებული ფორმატში შენახვა და გადაცემა, განსაკუთრებით ვებ-აპლიკაციებში სერვერსა და კლიენტს შორის. JSON-ის ძირითადი თვისებებია: მარტივი სინტაქსი, პლატფორმის დამოუკიდებლობა, მხარდაჭერა მრავალ პროგრამირების ენებში და ჰუმანური წაკითხვის შესაძლებლობა.