

# მეთოდი ის რაც დოტ ფუნქციის მერე იწერება
# lenght გვეუბნება სიის სიგრძეს
# len
# 1) თითოეულ მეთოდზე: len, append, insert, pop, remove მეთოდებზე გააკეთეთ 3-3 მაგალითი. len ფუნქციაზე მოიყვანეთ string-ის მაგალითიც
kk=[1,2,3,4,5,6,67,2]
my_list_lenght=len(kk)
print(my_list_lenght)
# .append() metoodi და მუსაობს მარტო სიებთან სიის ბოლოს ჩაამატებს ახალ რაგაცას
kk.append(300)
kk.append(333)
print(kk)
# . insert იწერება კერ ინდექსი რისი შეცვლაც გვინდა მაგ kk.insert(2,"ნიკა") პირველი უნდა იყოს ინდექსი მეორე ახალი მნიშ
kk.insert(2,"ნიკა")
print(kk)
# .remove(მნიშვნელობა (არა ინდექსი)) აშორებს ყველა იმ ელემენტს რაც წერია ფრჩხილში ,რამდენიმე რომც იყოს ისინიც წაიშლება
kk.remove(333)
# .pop (ინდექსი) შლის იმ ელემენტს რომელიც მდებარეობს მოცემულ ინდექსზე ,თუ არ წერია ინდექსი შლის -1 ხოლო თუ ვერ იპოვა ინდექსი მაშინ გამოიტანს ერრორს 
jj=[2,3,4,5,6]
jj.pop(2)
jj.insert(2, 100)
jj.remove(100)
print(jj)
ii=[1,2,3,4,5]
ii.pop()
ii.insert(0, 100)
ii.remove(100)
print(ii)
hh=[10,20,30,40,50]
hh.pop(0)
hh.insert(0, 100)
hh.remove(100)
print(hh)

nia="nikolozi"
print(len(nia))