# 2) დაწერეთ რა არის ფუნქცია, რისთვის ვიყენებთ, რამდენი ტიპის არსებობს, რა არის პარამეტრები, არგუმენტები და დაბრუნება (return)
# ფუნქცია არის კოდის ბლოკი, რომელიც ასრულებს კონკრეტულ დავალებას.
# ფუნქციის ტიპები არის ორი:
# 1. ჩვეულებრივი ფუნქციები, რომლებიც ასრულებენ დავალებას და არ აბრუნებენ მნიშვნელობას.
# 2. ფუნქციები, რომლებიც აბრუნებენ მნიშვნელობას (return).
# პარამეტრები არის ფუნქციის მიერ მიღებული მნიშვნელობები, რომლებიც განსაზღვრავენ ფუნქციის მუშაობას.
# არგუმენტები კი არის ის მნიშვნელობები, რომლებიც გადაეცემა ფუნქციას მისი გამოძახებისას.
# რეტურნი (return) არის ფუნქციის მიერ დაბრუნებული მნიშვნელობა, რომელიც შეიძლება გამოყენებულ იქნას სხვა კოდის ნაწილში.