// 1) შექმენით Map მონცამეთა ტიპი new Map([])-ის გამოყენებით რომელშიც დაამატეთ 5 მასივს წყვილს, მასზე გამოიყენეთ განხილული მეთდოები: delete, set, has, get, clear, keys, values, entries. შემდეგ შექმენით new Set([])-ის მეშვეობით set მონცამეთა ტიპი 5 ელემენტით და მასზეც გამოიყენეთ მეთოდები: add, delete, clear, has, size, values. კომენტარებით დაწერეთ რომელ მონცემთა თიპს გაგონებთ თითოეული პითონიდან და რატომ

//  Map() არის იმისთვის, რომლითაც შეგვიძლია შევინახოთ key-value წყვილები და  key შეიძლება იყოს ნებისმიერი ტიპის მნიშვნელობა.
const mymap= new Map(
    [
    [22,24],
    ['name','John'],
    [{a:1},'Object as a key'],
    ['mami',false],
    [3.14,['num pi','რიცხვი პი']]
    
    ]
)
// ყველა მაპის პლიუსი
// 1.ოპტიმიზირებულია
// 2.შეგვიძლია ნებისმიერი ტიპის მნიშვენელობა იყოს  key
// 3. შეგვიძლია გავზომოთ .size
console.log(mymap.size);
// 4.ადვილად შეგვიძლია გავწმნდოთ .clear
// 5.მაქვს სხვადასხვა მეთოდები .set .get .delete .has
// .set შეაქვს ახალი ელემენტი
mymap.set('nn',910)
// .get იღებს ელემენტს  key-ის მიხედვიტ
console.log(mymap.get('name'))
// .delete წაშლის ელემენტს key-ის მიხედვით
// has აბრუნებს true ან false-ს იმის მიხედვით თუ არსებობს თუ არა ელემენტი (key)
console.log(mymap.has(22));


// Set() არის იმისთვის, რომლითაც შეგვიძლია შევინახოთ უნიკალური მნიშვნელობები ნებისმიერ ტიპში.(იგივე რაც პითონში)
const myset=new Set([1,2,3,4,4,5,5,6,7,8,8,9])//თო 2 ერთი  და იგივე ელემენტი არის ის შეცდომას არ მოგვცემს ისე როგორც პითონში
// .size zoma
// .clear wasla
// .add damateba
console.log(myset.size);
myset.add(10)
console.log(myset);