# 3) შექნებით რიცხვების სია, შექმენით ახალი ცლვადი სახელად squares, რომელიც შეინახავთ ყველა რიცხვს რომელიც იყო თავდაპირველ სიაში ოღონდ აყვანილ მეორე ხარისხში, ამისთვის გამოიყენეთ list, map და lambda ფუნქციები. ასევე ცვლადი even-ს რომელშიც შეინახავთ თადავპირველ სიაში არსებულ მხოლოდ ლუწ რიცვებს, ამ შემთხვევაში გამოიყენეთ filter ფუნქცია
num = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

sq = list(map(lambda x: x ** 2, num))
even = list(filter(lambda x: x % 2 == 0, num))

print("square:", sq)
print("even :", even)

# . დაამატეთ manual_map და manual_filter თქვენს დავალებას თუ დრო დაგრჩათ და კომენტარებით ახსენით როგორ მუშაობს map და filter ფუნქცია, ასევე დაწერეთ რა არის lambda გამოსახულება და რატომ არის კარგი
# manual_map ფუნქცია იღებს ფუნქციას და სიას, აბრუნებს ახალ სიას სადაც ფუნქცია გამოყენებულია თითოეულ ელემენტზე
# manual_filter() ფუნქცია იღებს ფუნქციას და სიას, აბრუნებს ახალ სიას მხოლოდ იმ ელემენტებით, რომლებზეც ფუნქცია აბრუნებს True-ს
# map ფუნქცია იღებს ფუნქციას და iterable-ს, აბრუნებს ახალ iterable-ს სადაც ფუნქცია გამოყენებულია
# filter ფუნქცია იღებს ფუნქციას და iterable-ს, აბრუნებს ახალ iterable-ს მხოლოდ იმ ელემენტებით, რომლებზეც ფუნქცია აბრუნებს True-სზ
# lambda გამოსახულება არის ანონიმური ფუნქცია, რომელსაც სახელი არ აქვს და გამოიყენება მაშინ, როცა საჭიროა სწრაფად ან მოკლედ ფუნქციის აღწე

