# 7) მომხმარებელს შემოაყვანინეთ წინადადება, შემდეგ for ციკლისა და პირობითი განცხადებების საშვალებით დაბეჭდეთ ჯერ ხმოვნების, შემდეგ კი თანხმოვნების რაოდენობა (ხმოვნებად ჩათვალეთ სიმბოლოები: a, e, i, o, u ხოლო სხვა ყველა თანხმოვნად)
input_string = input("შეიყვანეთ წინადადება: ")
ხმო = "aeiouAEIOU"
თანხმო = "bcdfghjklmnpqrstvwxyzBCDFGHJKLMNPQRSTVWXYZ"
ხმოვნების_რაოდენობა = 0
თანხმოვნების_რაოდენობა = 0
for char in input_string:
    if char in ხმო:
        ხმოვნების_რაოდენობა += 1
    elif char in თანხმო:
        თანხმოვნების_რაოდენობა += 1
print("ხმოვნების რაოდენობა:", ხმოვნების_რაოდენობა)
print("თანხმოვნების რაოდენობა:", თანხმოვნების_რაოდენობა)