// 2) თქვენი სიტყვებით ახსენით რა არის useEffect hook. დაწერეთ როდის იძახება იგი კომპონენტში და რა განსხვავებაა useEffect-ის გარეშე და useEffect-ით შესრულებულ ლოგიკას შორის


// useEfect - მაშინ გაიშვება როცა dependency array-ში მოცემული მნიშვნელობა შეიცვლება
// თუ მაგალითად count შეიცვლება, useEffect-ის callback ფუნქცია გაიშვება და არ მოხდება სხვა შემთხვევებში
// render happens
//  1.კომპონენტის ჩატვირთვისას
//  2.მდგობების ცვლილებისას

// მოკლედ რომ ჩამოვაყალიბოთ  useEffect გვჭირდება იმისთვის რომ რაღაც კონკრეტული კოდის ბლოკი ერთზე მეტჯერ არ გაიშვას
// მაგალითად API request-ის გაგზავნა ან კონსოლში რაღაცის დაბეჭდვა როცა კონკრეტული state შეიცვლება
