import { useState } from 'react';

// 4) თქვენი სიტყვებით ახსენით შემდეგი ცნებები:

// - state: ის მონაცემები, რომლებიც კომპონენტში იცვლება დროთა განმავლობაში
// - hook: ფუნქცია, რომელიც React ფიჩარს გვაძლევს ფუნქციონალურ კომპონენტებში
// - built-in hook: React-ის წინასწარ ჩამოყალიბებული hook-ები (მაგ. useState, useEffect)
// - useState: hook რომელიც state-ს დაამატებინებს ფუნქციონალურ კომპონენტებში
// - setter function: ფუნქცია, რომელიც state-ის მნიშვნელობას იცვლის
// - component re-render: კომპონენტის ხელახლა გაწერა/ხელახლა ჩვენება, როდესაც state-ი იცვლება

