# 2) შექმენით ერთი ცვლადი რომელშიც შეინახავთ თქვენს სრულ სახელსა და გვარს, ამ სიტყბების პირველი ასოები უნდა იყოს დიდი. შემდეგ for ციკლის მეშვეობით გადაურეთ თქვენს სრულ სახელს და შეამოწმეთ სახელის და გვარის პირველი ასოები თუ დიდი, მათთან აიღეთ კიდევ 3 სხვა დიდი სიმბოლო თქვენი სრული სახელიდან და შეამოწმეთ ასეთი თუ გხვდებათ თქვენი სახელიდან, თუ ასეა მაშინ result ცვლადს (რომელსაც შექმნით for ციკლის გამოყენებამდე და შეინახავთ ცარიელ სტრინგს) დაამატეთ ამ ასოების პატარა ვერსია მაგ: (თუ char == "A": result += "a" 
n="Nika Kviciani"
chars = "ABC"
result = ""
for char in n:
    if char in chars:
        result += char.lower()
print(result)
# lower() - ამცირებს სიმბოლოს
# upper() - ზრდის სიმბოლოს
print(n.lower())
# capitalize() -პირველი სიმბოლო უნდა იყოს დიდი, დანარჩენი პატარა
# title() - ყველა სიტყვის პირველი სიმბოლო უნდა იყოს დიდი, დანარჩენი პატარა
# swapcase() - ყველა სიმბოლოს შემთხვევაში უნდა შეიცვალოს
