// date object
// datr(year,month,hour,minute secend)
// 2) შექმენით თარიღის ობიექტი, რომელშიც შეინახავთ 2023 წლის სექტემბერის 5 რიცხვს. ამისთვის გადაეცით date ობიექტის სტირნგის სახით თარიღი, კომენტარებით დაწერთ კიდევ როგორ შეიძლება date ობიექტს გადავცეთ თარიღი და თუ არ გადავცემთ არგუმენტს რა მოხდება. შექმნილი date ობიექტი შეინახეთ hireDate ცვლადში და ცალცალკე კონსოლში გამოიტანეთ წელი, თვე, რიცხვი, კვირის დღე, საათები, წუთები და წამები
let hireDate = new Date("2023-09-05-")
console.log(hireDate.getFullYear()) // 2023
console.log(hireDate.getMonth() + 1) // 9 (თვეები იწყება 0-დან ამიტომ ვუმატებთ 1)
console.log(hireDate.getDate()) // 5 (რიცხვი)