// 7) შექმენით ფუნქცია სახელად manualSlice რომელსაც გადაეცემა პირველი მასივი და ორი რიცხვი საწყისის ინდექსი და დასასრულის ინდექსი, თქვენი დავალებაა გადმოცემული ინდექსიდან მეორე ინდექსამდე ჩამოაჭრათ სიას ნაწილიდა დააბრუნოთ ფუნქციიდან გამოიყენეთ for ციკლი
function manualSlice(list, startIndex, endIndex) {
  const slicedList = []; // ახალი ცარიელი სია დაჭრილი ელემენტებისთვის       
    for (let i = startIndex; i < endIndex; i++) { // ვიწყებთ საწყისი ინდექსიდან და მივდივართ დასასრულის ინდექსამდე
        slicedList.push(list[i]); // ვამატებთ ელემენტს ახალ სიაში
    }
    return slicedList; // ვაბრუნებთ დაჭრილ სიას
}