# # # dot წერტილი რომელიც ფუნქციას გამოყოფს
# # # __init__  __  მეთოდი რომელიც კლასის შექმნისას ავტომატურად იწერება
# # # მაგ
# # print("hello world".lower()) # hello world
# # print("hello world".upper()) # HELLO WORLD
# # print("hello world".title()) # Hello World
# # print("hello world".capitalize()) # Hello world
# # # print("hello world".title()) # Hello World
# # kk="hello world"
# # print(kk.title()) # amas metodi hqvia pithonsi
# # # capitalize() - პირველი ასო დიდია დანარჩენი პატარა
# # # title() - ყველა სიტყვის პირველი ასო დიდია დანარჩენი პატარა
# # # lower() - ყველა ასო პატარაა
# # # upper() - ყველა ასო დიდია
# # # isalpha() - აბრუნებს True თუ ყველა ასო არის ასო
# # # isdigit() - აბრუნებს True თუ ყველა ასო არის ციფრი
# # # isalnum() - აბრუნებს True თუ ყველა ასო არის ასო ან ციფრი
# # # isspace() - აბრუნებს True თუ ყველა ასო არის ცარიელი ადგილი
# # # islower() - აბრუნებს True თუ ყველა ასო არის პატარა
# # # isupper() - აბრუნებს True თუ ყველა ასო არის დიდი
# # # isalnum() - აბრუნებს True თუ ყველა ასო არის ასო ან ციფრი
# # # isalpha() - აბრუნებს True თუ ყველა ასო არის ასო
# # # isdigit() - აბრუნებს True თუ ყველა ასო არის ციფრი
# # # isspace() - აბრუნებს True თუ ყველა ასო არის ცარიელი ადგილი
# # # islower() - აბრუნებს True თუ ყველა ასო არის პატარა
# # # isupper() - აბრუნებს True თუ ყველა ასო არის დიდი
# # # isalnum() - აბრუნებს True თუ ყველა ასო არის ასო ან ციფრი
# # # isalpha() - აბრუნებს True თუ ყველა ასო არის ასო
# # # isdigit() - აბრუნებს True თუ ყველა ასო არის ციფრი
# # # string.find() - აბრუნებს ინდექსს თუ სად არის სიტყვა
# # # string.index() - აბრუნებს ინდექსს თუ სად არის სიტყვა
# # # მეთოდი არის



# # word = "Hello"
# # #       01234


# # # მეთოდი - ფუნქცია რომელიც იწერება dot ნოტაციის სინტაქსით, ესეიგი პირველ რიგში წერთ მნიშვენლობას შემდეგ . და ფუნქციას(). მეთოდები ჩვეულებრივი ფუნქციებისგან იმით განსხვავდებიან რომ მეთოდების გამოყენება შეგვიძლია მხოლოდ შესბამისი ტიპის მქონე მნიშვნელობებთან

# # # მეთოდები

# # # string.upper() - მეთოდი რომელიც სტრინგის ყველა სიმბოლოს გადაიყვანს upper case-ში
# # print(word.upper())
# # # string.upper() - მეთოდი რომელიც სტრინგის ყველა სიმბოლოს გადაიყვანს lower case-ში
# # print(word.lower())
# # # string.capitalize() - ამ მეთოდის საშვალებით სტრინგის მხოლოდ პირველი სიმბოლოა დიდი
# # print(word.capitalize())
# # # string.find(საძიებელი სიმბოლო/ელემენტი) გამოიტანს საძიებელი მნიშვნელობის პირველივე გამოჩენის ინდექსს ხოლო თუ ასეთი მნიშვნელობა ვერ მოიძებნა დააბრუნებს -1
# # print(word.find("olo"))




# mm="hello world"
# mm=mm.upper()
# print(mm) # HELLO WORLD
# # # string.replace(ძველი მნიშვნელობა, ახალი მნიშვნელობა) - ამ მეთოდის საშვალებით შეგვიძლია შევცვალოთ სტრინგში არსებული სიმბოლოები
# # ცვლადის მნიშვნელობა არ იცვლება
# # ცვლადი იცვლება მხოლოდ იმ შემთხვევაში თუ მას მივანიჭებთ ახალ მნიშვნელობას და ეს შეიძლება იყოს მისი ძველი მნიშვნელობა და ფუნქცია


# # find ფუნქცია გამოიყენება იმისთვის რომ ვიპოვოთ კონკრეტული სიმბოლო სტრინგში
# ჯნკჯ="hello world"
# print(ჯნკჯ.find("o")) # 4









# 1) პირდაპირ გამოიყენეთ string-ებზე lower, upper, capitalize, მეთოდები კომენტარებით დაწერეთ რა არის მეთოდი რით განსხვავდება ჩვეულებრივი ფუნქციისგან, რა არის dot ნოტაცია. ასევე გააკეთეთ 3 მაგალითი find მეთოდზე, აუცილებლად უნდა იყოს 3 შემთხვევა: error, -1, რაიმე პოზიციას (index)
aa="hello world"
print(aa.lower()) # hello world
print(aa.upper()) # HELLO WORLD
print(aa.capitalize()) # Hello world
kk="hai"
print(kk.lower()) # hai
print(kk.upper()) # HAI
print(kk.capitalize()) # Hai
jj="kakaka"
print(jj.lower()) # kakaka
print(jj.upper()) # KAKAKA
print(jj.capitalize()) # Kakaka
# მეთოდი არის ფუნქცია რომელიც იწერება dot ნოტაციის სინტაქსით, ესეიგი პირველ რიგში წერთ მნიშვენლობას შემდეგ . და ფუნქციას(). მეთოდები ჩვეულებრივი ფუნქციებისგან იმით განსხვავდებიან რომ მეთოდების გამოყენება შეგვიძლია მხოლოდ შესბამისი ტიპის მქონე მნიშვნელობებთან
# dot ნოტაცია გვაძლევს საშუალებას გამოვიყენოთ ფუნქციები კონკრეტული ტიპის მნიშვნელობებზე, მაგალითად str ტიპის მნიშვნელობაზე შეგვიძლია გამოვიყენოთ str.upper() მეთოდი(ertmanets ukavsirdeba)

aa.find("o") # 4
aa.find("a") # -1
aa.find("h") # 0
aa.find("k") 